programa
{
	inclua biblioteca Util --> u //adicionando uma biblioteca
	
	funcao inicio()
	{

		cadeia player
		inteiro faccao
		inteiro energia, ataque, DanoDeAtaque, recuperacao, dano, descanco
		inteiro evento, opcao
		inteiro dificuldade
		

		//status padrão (muda conforme a classe)
		energia = 90
		dano = 20
		recuperacao = 20
		DanoDeAtaque = 10
		descanco = 5
		
		




escreva("\n:::::--------------======------------------------:::----------:::::::---------------===+++++++++++++*********+++=======-")
escreva("\n:::::.::--:::::----------===--=-------=====--::::::::::---------::::::::::::------===++++++*************+++++++===------")
escreva("\n-----:   :---:::---------------=----=======---::::::::::--------::::::::::------====++****************+++========-------")
escreva("\n.:----.  .---------::::::----------==++++==-----:::::::::-------::---::::-------==++****#######*****++=========---------")
escreva("\n         .=--===-------::::::::------==++***++++=-::::::::::::::::::::-----==++++**###############***+====---------.    ")
escreva("\n         .  =++++==+=---------:::-----==+**+++++=--::::::::::::::--------==+***####**++++*######*++++===----------:.   ")
escreva("\n         .  .+++**++++===-------:::-----========+*=--:::::::::::::-------===+*#####*+===++*#####*+=====------------:    ")
escreva("\n          ..:=++**++=====------:::::----------=====-::::::::::::--=--==+=+*####*++=======+****+====----------==--.     ")
escreva("\n              :******+=====------::::::----------==------::::::::---=--=+++****++==========+*++===---------====-:      ")
escreva("\n            . -******+=====-------:::::::::::::-------------:::::-----=====+*+======-----===++===----------==-.        ")
escreva("\n        .     ..=*++*+++=====-------::::::::::::::::::::-------------=+=---====------------======-----------==-.        ")
escreva("\n                .==+++============------::::::::::::::::::----------====--------------------=====---------===-          ")
escreva("\n                . -========+++==++======----------::::::----------====-------------------------=--------===-=-.      .  ")
escreva("\n        .    --: :============+++++==++==----------:::----------------------------:--:--------------=====-----: .-.     ")
escreva("\n           . -=- -===================+++=--------------------:------------=----------------------=============- .-.     ")
escreva("\n            ..:: -==--==----=======+++=+===----------------:::::------------------------------==============++- ..      ")
escreva("\n       .     .. .-====-----------======+**+=====---------::::::::---====------------------======++++++++++++++=.        ")
escreva("\n       .       . -========------------=++===========----:::::::::---====-------------=====++++*****+=++*****#*=         ")
escreva("\n                 .-++++=======---------====-----==+=-----:::::::--------=---------===++++++++#****+++++++****+-         ")
escreva("\n            .-  :+==--===..+++===-------=====----==++==-----------------====++++=+++++==+++++*****+====+++++==-. :-.  : ")
escreva("\n                .    .::-..:+*#*+=======--===----=============-----======+*#*++++++++++++++*++++++++==========-. :=.    ")
escreva("\n      .   .  .   .         .=######***+=========------=====++======++++++***++=+++***+***-..:::-==+++=====--===: .-.    ")
escreva("\n      .      .    :- ....:-:+###%#%%%####**+++====-----=========+++++++++++=====++*####**++=+++++===-::-==:.+*+-        ")
escreva("\n    .      .:  . :.=*+:.:-*#*#######%%%%%###*++=========+++++*****++++=======+++*#####******++++==+==--=: =+-.  .     ")
escreva("\n      .        :         ...*****###*##**#%%%%%%*+++==++++****%%%%%***++++===+++=++**+*******++++++++++*+*: **-         ")
escreva("\n           .     .         .-**********++***#####*##***#%##%@@@@@@@%**++++++++++++++***##***##****#######++ =#+.        ")
escreva("\n      ..   .    ...      ....=*****************#%%%%****#%@@@@@%%%%%#**+++++++++++**##*+*++*############**=.:-*=  -++:  ")
escreva("\n      . .:.     :.     ....==+****=:-+*****+*+**##*******#%@@@%%%%%##****+++++++++++++++++**#####%#####-=*+.  :-. .=+.  ")
escreva("\n      .   ...   :       ..  -+**=:........:=+-**+*+++++***#%#%%###%%%%##****++*++++++++****#######*****-  :        ..   ")
escreva("\n     ..     ... .        ..:+##*-::.......::=-=#*++++++++***#%%%@@@@@@%%%%%####*****######%#####*****+=-.               ")
escreva("\n     ..    .  :..          :.+##=.............-+**#**+++****##%%%%%%%%%%%%%%%%%%%%%%%%%########****++==:..        .     ")
escreva("\n    .          .       .-:-*###==... ..  .:..:+**####*****#%@@@@@%%@%%@%%%#**###%#*###*#*******++++=+=.                ")
escreva("\n     .         .:        .:-*###-..........:..-+******#######%@@@@@@@@%%#********************++++++++=:   .             ")
escreva("\n       .  .    ..          .-*#*..............-++++++++****##%@@@%%%##****++++**+***********+++++++++--.:.              ")
escreva("\n      ......   ..        .-.=+*=:-............-=+++++++******##%%###******+*****************+++=+++++::.                ")
escreva("\n    .     ..  .       ...=:==+=..... .....:::-+++++++****#####%%%%#**********=-=**++=:-+****+=-+++=--:.        ..      ")
escreva("\n     .        ..        ....::::. ...........::=********##%%%%@@@@%%%%%%#%%%#=:..........::::-+=+++-.            .      ")
escreva("\n     .         .         . ..   ............:::*########%##%%%@@@@@@@@%%%%%%#::....... ......-+=**+:..                  ")
escreva("\n     .         :       ...       .:...........-*##***##%%%%%@@@@@@@@@@@@@%%%*:::..............=+*#*==+.:.               ")
escreva("\n               .        ...    . .......:::::::++==-=+*#####%%%%%@@@%%%%%%%%#:::.............:++=*+:-:   .        .     ")
escreva("\n              .               .:.............:*+---=+*############%%%######+::.......   ......                          ")
escreva("\n    . .       .    ..         .:..  ...:....:-+=----+*##%%#%%%%%%%%%#######+::..............::-                        ")
escreva("\n        ....:..      .:.       ..:.   ..-:..::--=----=+*##%#%%%%%%%%#*++*###=:................:.                        ")
escreva("\n            .                  ....  .. ::..:::---:--+*****###%#%%%%#+==+***=...........:. ...                          ")
escreva("\n                         ...   ....  ......:::-::::--++**++*########*+==+#*+-............         .                     ")
escreva("\n         .                     .... .. .:...:::::::--=+**+++########*======-:............ .    ....                     ")
escreva("\n                               .:.. ..... ..:::::::--=++*++++#######+---=--::..........:.                         .     ")
escreva("\n       ::                 ..   ....... .....::-:::::---=+++++*###***=----::::............          .                    ")
escreva("\n       .::.             . .......  . ......::::::::---=+++***##*+++=---::::............... .  .                        ")
escreva("\n          .::.                 ...  .. .::...::::::----==+=: :+*++===-:::::................ ..           .              ")
escreva("\n                         .   .. .  ..........::.:::--===-     +++==--:-::....................  .. .   .                 ")
escreva("\n                .           ...............:.::::::---===.     :+===--::::::.....................  .                    ")
escreva("\n                  ..  .... ......... ...::.:.::::::--==:       ===---:::::................. .....  .                   ")
escreva("\n                       .......... ...  .. ...::::::---.          .:----:::::::::..::....   .           .   .            ")
escreva("\n             ..:.        .:::  .---..       ...::::-:              .------::::::.....         . .-.      :              ")
escreva("\n          ....       ..:::   .:     .......:.....:--:               :--::..::.......                                    ")
escreva("\n.                           .  :.    ...........:::-.               :==-:.........       .          ..                  ")
escreva("\n           .                   ...    ....::::::::-:.               .----::::.....   ..     .   ..                      ")
escreva("\n                    .::.  .. ....   ....  . . ...:::                 ---:::..       ...::..                             ")
escreva("\n                                         ....::----:                 :=--:-:::.....             .                  .    ")
escreva("\n                                 ... ...:.....:::--.                 .:-::----:::::.....  .            ..       .       ")
escreva("\n        .                        .  .. ....:::-:----.               .---:.  ...   .......           .                   ")
escreva("\n           .                              .::::..:-=:.:           : :---:::::.....  .      ..  .       ..               ")
escreva("\n  ..                            .... ........:::...::--           -=-:-----:::::......:.......            ...           ")
escreva("\n.                      .......:...   .....::-:--===++=-     .    .+**+--::--::........                         ...      ")
escreva("\n                 .....  .. .................::.:..::.::.    -    ----===--::::::..... .                                 ")
escreva("\n                              ..   ...::::::::--------=-    =    ++=-=+--===--::::::..  .   ..                          ")
escreva("\n                      ..         ...         .:::--==-:   .-    ::-. .:...     ..   .....                               ")
escreva("\n              .          .  ..  ......::::::::---:::::--    =    --===--=-:-=---:....::. .                              ")
escreva("\n               .        ....  ...........:::------:-:..-.   .   .==::-====-=-::.:::.  .   .                      .      ")
escreva("\n                     .....    ..........:::-----::....:-.       :==-::..  .  ..             ..   .:...                  ")
escreva("\n            ..........       .  ..  ....:. ..::.::---=--       :::::::-=-: ..::.....                                    ")
escreva("\n                ..                ..... .--:..:::::::----   .   :----=---===---:................                        ")
escreva("\n                      ....    ...    ..:--::-::-----==-:   -   :-=-------:::---:::..::.....    .    ....               ")
escreva("\n                               ..... .::::::-------:.:..          .:-=--:..-==----:......                               ")
escreva("\n                                    ................  ...       :-:..-=---: .:....  ...  ....                           ")
escreva("\n                                   .... ....::::::::---:.       ..::.... .:-::.::::..:::..  ..                          ")
escreva("\n                                 ..          ...  ....::        .::..-::=+=-:::::::::::..                               ")
escreva("\n                                   ...::::::::::::.....         ....:.....::::::::::........                            ")
escreva("\n                              ..      ........:......           .. .........................                            ")
escreva("\n                                .  ...........:.....            ...:----:.:::............                               ")
escreva("\n                                          .......                   .::  ::..........                                   ")
escreva("\n                                                                  .       .....                                         ")
escreva("\n                                                                       ..:  ..                                          ")
escreva("\n                                                                       ...                                              ")
escreva("\n                                              .                       ...                                               ")
escreva("\n                                                                      ... ..                                            \n\n\n\n\n\n\n\n")

		











		

		escreva("''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''\n")
		escreva("'                       inicie o jogo                                           '\n")
		escreva("''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''\n")

		escreva("\ncrie um username: ")
		leia(player)

		escreva ("\nEscolha uma dificuldade: \n 1- zona segura (Fácil: 90 pontos de energia no começo) \n 2- sobrevivente (médio: 65 pontos de energia ) \n 3- brutal (difícil: 40 pontos de energia) \n 4- sem esperança (muito difícil: 30 pontos de energia) \n\n -->")
		leia (dificuldade)

		escolha(dificuldade){

			caso 1:
				energia = 90
				escreva("Dificuldade escolhida: zona segura")
				escreva("boa sorte\n\n\n")
			pare

			caso 2:
				energia = 65
				escreva("Dificuldade escolhida: sobrevivente")
				escreva("boa sorte\n\n\n")
			pare
			caso 3:
				energia = 40
				escreva("Dificuldade escolhida: brutal\n")
				escreva("boa sorte\n\n\n")
			pare
			caso 4:
				energia = 30
				escreva("Dificuldade escolhida: sem esperança \n")
				escreva("boa sorte")
			caso contrario:
				escreva ("Escolha uma dificuldade válida: \n")
			pare

			
		}// fim do escolha


		
		
	
		//ESCOLHENDO AS FACÇÕES
		
		faca {


			escreva ("\nfacções disponíveis: \n")
		
			escreva ("\n1- militares \n VANTAGENS: eventos perigosos causam menos dano. Evento: -10 energia (em vez de -20)\n DESVANTAGENS: descançar é menos eficiente. Descansar: -8 (em vez de -5)\n")
		
			escreva ("\n2- médicos \n VANTAGENS: Ao procurar suprimentos, recuperam mais energia. Procurar suprimentos: +15 energia (em vez de +10)\n DESVANTAGENS: Começam a missão com menos energia. Energia inicial reduzida em 10 pontos\n")
		
			escreva ("\n3- saqueadores \n VANTAGENS: Ao procurar suprimentos existe 40% de chance de encontrar recursos extras, recuperando +10 de energia adicional. \n DESVANTAGENS: Eventos perigosos causam mais dano. Evento: -25 energia\n")
		
			escreva ("\nESCOLHA A SUA FACÇÃO: ")
			leia (faccao)

			se(faccao == 1){

				dano =  10
				descanco =  8
		
		
			
				}//fim do se

			senao se(faccao == 2){

			recuperacao =  15
			energia = energia - 10

			
				}//fim do senao se

			senao se(faccao == 3){


				dano = 25
				
			}//fim do senao se


			
		
			senao{

				escreva ("\nEscolha uma facção que esteja disponível ")
				
			}//fim do se		
			
	//ESCOLHENDO AS FACOÇÕES
		

			
		}enquanto (faccao < 1 ou faccao > 3)

		escreva ("Facção escolhida com sucesso: ")

		
	
		
//PRIMEIRO TURNO
		escreva ("\n\n\nPrimeiro turno")

		u.aguarde(1500)//intervalo de 5 segundos entre as menssagens

		escreva ("\n\n\nVocê sai da sua base, e sabe que tem uma missão... Ir para a aurora, a última base humana")

		u.aguarde(3000)// intervalo de 5 segundos entre as menssagens

		escreva ("\n\n\nO que você irá fazer?\n\n\n")






		
//SEGUNDO TURNO
		escreva ("Segundo turno")

		escreva ("\n\n\nO que você irá fazer?\n\n\n")

		evento = u.sorteia(1, 3)

		faca{

			
		escreva("1- explorar a cidade\n")
		escreva("2- descansar em um abrigo\n")
		escreva ("3- procurar suprimentos\n")
		escreva(":")
		leia(opcao)


		
			
		}enquanto (opcao < 1 e opcao > 3)
		escreva ("Escolhar uma opção correta")

		
		
		
		
		
		

		
		
	}
}
/* $$$ Portugol Studio $$$ 
 * 
 * Esta seção do arquivo guarda informações do Portugol Studio.
 * Você pode apagá-la se estiver utilizando outro editor.
 * 
 * @POSICAO-CURSOR = 15255; 
 * @PONTOS-DE-PARADA = ;
 * @SIMBOLOS-INSPECIONADOS = ;
 * @FILTRO-ARVORE-TIPOS-DE-DADO = inteiro, real, logico, cadeia, caracter, vazio;
 * @FILTRO-ARVORE-TIPOS-DE-SIMBOLO = variavel, vetor, matriz, funcao;
 */